# 第三章 关系数据库标准语言SQL

In [1]:
%load_ext sql

d:\python27\lib\site-packages\IPython\config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
d:\python27\lib\site-packages\IPython\utils\traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

###  连接你所创建的数据库
通过pgAdmin III在PostgreSQL数据库中创建Ex2数据库，并连接该数据库

In [2]:
%%sql postgresql://postgres:postgres@localhost:5432/ex2

SET statement_timeout = 0;
SET lock_timeout = 0;
SET client_encoding = 'utf-8';
SET standard_conforming_strings = on;
SET check_function_bodies = false;
SET client_min_messages = FATAL;

Done.
Done.
Done.
Done.
Done.
Done.

[]

### 3.4 数据查询

### 3.4.1 The basic SELECT statement
选择语句的基本格式
    <p>SELECT    A1, A2, …, An      #3: what to return
    <p>FROM     R1, R2, …, Rn     #1: relations to query
    <p>WHERE    condition	       #2: combine, filter relations

语义上的执行顺序是：先做笛卡尔积，然后做选择，最后做投影。

In [6]:
from display_tools import side_by_side
%sql drop table if exists R;
%sql drop table if exists S;
%sql create table R(A int);
%sql create table S(B int, C int);
%sql insert into R values (1), (3);
%sql insert into S values (2, 3), (3, 4), (3, 5);
r = %sql select * from R;
s = %sql select * from S;
side_by_side(r, s)

Done.
Done.
Done.
Done.
2 rows affected.
3 rows affected.
2 rows affected.
3 rows affected.

查询语句
    <br>SELECT R.A
    <br>FROM   R, S
    <br>WHERE  R.A = S.B
的结果为：

In [8]:
%%sql 
select R.A 
from R, S
where R.A = S.B

2 rows affected.

[(3,), (3,)]

如果用python实现上述查询，等价的代码如下：

In [9]:
R = [1, 3]
S = [(2, 3), (3, 4), (3, 5)]

result = []
for A in R:
    for (B, C) in S:
        print A, B, C
        if A == B:
            result.append(A)
            
result

1 2 3
1 3 4
1 3 5
3 2 3
3 3 4
3 3 5

[3, 3]

下面我们采用美国高中生申请大学数据库为例：

College(<u>cName</u>, state, enrollment)

Student(<u>sID</u>, sName, GPA, sizeHS)

Apply(<u>sID</u>, <u>cName</u>, <u>major</u>, decision)

In [3]:
%%sql
drop table if exists College;
drop table if exists Student;
drop table if exists Apply;

create table College(cName text primary key, state text, enrollment int);
create table Student(sID int primary key, sName text, GPA real, sizeHS int);
create table Apply(sID int, cName text, major text, decision text);

alter table Apply add constraint pk primary key(sID, cName, major);

Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [4]:
%%sql  
copy Student(sID, sName, GPA, sizeHS) from  'e://student.txt' delimiter '|';
copy College(cName, state, enrollment) from  'e://college.txt' delimiter '|';
copy Apply(sID, cName, major, decision) from  'e://apply.txt' delimiter '|';

12 rows affected.
4 rows affected.
20 rows affected.

[]

### 3.4.2 Table and Attribute Variables
#### What if attributes have the same name?

In [12]:
%sql drop table if exists A; drop table if exists B;
%sql create table A (x int, y int); create table B (x int, y int);
for i in range(1,6):
    %sql insert into A values (:i, :i+1)
for i in range(1,11,3):
    %sql insert into B values (:i, :i+2)

Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

In [13]:
%sql SELECT A.x FROM A, B WHERE A.x = B.x;  -- A，B做对x属性做表连接，查询x属性

2 rows affected.

[(1,), (4,)]

#### 查询关系A和B在x列上的重叠记录

In [14]:
r = %sql SELECT * FROM A;
s = %sql SELECT * FROM B;
side_by_side(r,s)

5 rows affected.
4 rows affected.

In [15]:
%%sql
SELECT x, y FROM (
    SELECT A.x, A.y FROM A, B WHERE A.x = B.x
    UNION
    SELECT B.x, B.y FROM A, B WHERE A.x = B.x
) as T(x, y);

4 rows affected.

[(1, 3), (4, 5), (4, 6), (1, 2)]

### 3.4.3 Set Operators in SQL
#### In-Class Exercise: Write a SQL query thar return the IDs of students who applied to CS but no EE.

In [16]:
%%sql 
SELECT sid FROM Apply WHERE major = 'CS' 
except 
SELECT sID FROM Apply WHERE major = 'EE'

6 rows affected.

[(456,), (543,), (654,), (432,), (987,), (123,)]

For three tables $R,S,T$ that only have one attribute $A$:
* R = {1,2,3,4,5}
* S = {1,3,5,7,9}
* T = {1,4,7,10}

In [17]:
%sql DROP TABLE IF EXISTS R; DROP TABLE IF EXISTS S; DROP TABLE IF EXISTS T;
%sql CREATE TABLE R (A int); CREATE TABLE S (A int); CREATE TABLE T (A int);
for i in range(1,6):
    %sql INSERT INTO R VALUES (:i)
for i in range(1,10,2):
    %sql INSERT INTO S VALUES (:i)
for i in range(1,11,3):
    %sql INSERT INTO T VALUES (:i)

Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

Can you write a query to select $R \cap (S \cup T)$- in other words elements that are in $R$ and either $S$ or $T$?

Write your query here:

In [18]:
%%sql
SELECT DISTINCT R.A
FROM R, S, T
WHERE R.A = S.A OR R.A = T.A;

4 rows affected.

[(4,), (1,), (5,), (3,)]

Now test your query above for the case where $S = \emptyset$- what happens and why?

Execute the below, then re-run your query above

In [19]:
%%sql
delete from S;

5 rows affected.

[]

In [20]:
%%sql
SELECT DISTINCT R.A
FROM R, S, T
WHERE R.A = S.A OR R.A = T.A;

0 rows affected.

[]

### 3.4.4 Subqueries in the WHERE clause
#### Follow-up question: MySQL doesn't support the except keyword - can this query be rewritten to work in MySQL?

In [21]:
query = """
SELECT sID FROM Student
    WHERE sID in (SELECT sID FROM Apply WHERE major = 'CS') and
          sID not in (SELECT sID FROM Apply WHERE major = 'EE');
"""
l = %sql $query

query = """
SELECT distinct sID FROM Apply A1 
WHERE major = 'CS' and 
      not exists (SELECT * FROM Apply A2 WHERE A1.sID = A2.sID and major = 'EE');"""

r = %sql $query

side_by_side(l, r)

6 rows affected.
6 rows affected.

sid
456
543
654
432
987
sid
123
432
456
543
654

#### Nested queries as alternatives to INTERSECT and EXCEPT

In [22]:
%sql drop table if exists R; drop table if exists S;
%sql create table R (A int, B int); create table S (A int, B int);
for i in range(1,6):
    %sql insert into R values (:i, :i+1)
%sql insert into R values (1, 2)
for i in range(1,11,3):
    %sql insert into S values (:i, :i+1)
r = %sql SELECT * FROM R;
s = %sql SELECT * FROM S;
side_by_side(r,s)

Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
6 rows affected.
4 rows affected.

Intersect等价实现，数据有重复时，如何解决？

In [23]:
query = """
SELECT R.A, R.B FROM R
 INTERSECT
SELECT S.A, S.B FROM S
"""
l = %sql $query

query = """
SELECT R.A, R.B
FROM   R
WHERE EXISTS (SELECT * FROM S WHERE R.A=S.A AND R.B=S.B)
"""
r = %sql $query

side_by_side(l, r)

2 rows affected.
3 rows affected.

Except等价实现

In [24]:
query = """
SELECT R.A, R.B FROM R
 EXCEPT
SELECT S.A, S.B FROM S
"""
l = %sql $query

query = """
SELECT R.A, R.B
FROM   R
WHERE NOT EXISTS (SELECT * FROM S WHERE R.A=S.A AND R.B=S.B)
"""
r = %sql $query

side_by_side(l, r)

3 rows affected.
3 rows affected.

### 3.4.6 The Join Operators

In [25]:
%sql drop table if exists R; drop table if exists S;
%sql create table R (A int, B varchar(50)); create table S (A int, B varchar(50));
%sql insert into R values (1, 'Cat'), (2, 'Dog'), (3, 'Dog');
%sql insert into S values (1, 'Apple'), (2, 'Banana'), (2, 'Pear'), (4, 'Lemon');
r = %sql SELECT * FROM R;
s = %sql SELECT * FROM S;
side_by_side(r,s)

Done.
Done.
Done.
Done.
3 rows affected.
4 rows affected.
3 rows affected.
4 rows affected.

#### Inner Join

In [26]:
query = """
select R.A, S.B from R, S where R.A = S.A
"""
l = %sql $query

query = """
select R.A, S.B from R join S on R.A = S.A
"""
r = %sql $query

side_by_side(l, r)

3 rows affected.
3 rows affected.

#### Left Outer Join

In [27]:
%sql select R.A, S.B from R left outer join S on R.A = S.A

4 rows affected.

[(1, u'Apple'), (2, u'Pear'), (2, u'Banana'), (3, None)]

#### Right Outer Join

In [28]:
%sql select R.A, S.B from R right outer join S on R.A = S.A

4 rows affected.

[(1, u'Apple'), (2, u'Banana'), (2, u'Pear'), (None, u'Lemon')]

#### Full Outer Join

In [29]:
%sql select R.A, S.B from R full outer join S on R.A = S.A

5 rows affected.

[(1, u'Apple'), (2, u'Pear'), (2, u'Banana'), (3, None), (None, u'Lemon')]

#### In-Class Exercise: Is the Full Outer Join operator associative? （课堂检查1）
Specifically is<br/>
  SELECT *
  FROM (T1 full outer join T2) full outer join T3;<br/>
    equivalent to<br/>
  SELECT *
  FROM T1 full outer join (T2 full outer join T3);

In [7]:
## 创建关系T1，T2，T3，验证上述语句是否等价
%sql drop table if exists T1; drop table if exists T2;drop table if exists T3;
%sql create table T1 (A int, B int); create table T2 (B int, C int); create table T3 (A int, C int);
%sql insert into T1 values (2,1);
%sql insert into T2 values (1,3);
%sql insert into T3 values (3,4);
r = %sql SELECT * FROM (T1 natural full outer join T2) natural full outer join T3;
s = %sql select * from T1 natural full outer join (T2 natural full outer join T3);
side_by_side(r,s)

Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
2 rows affected.
3 rows affected.

### 3.4.7 Aggregation
特别注意：every column in the SELECT clause must either be<br/>
* Also present in the GROUP BY clause AND/OR
* Used in an aggregation function

In [53]:
%sql select A from S group by A;

3 rows affected.

[(4,), (1,), (2,)]

In [54]:
%sql select B from S group by A;

(psycopg2.OperationalError)  [SQL: 'select B from S group by A;']

#### In-Class Exercise: 查询每个学校的申请人中，GPA的最高和最低值，返回校名，GPA的最高和最低值

In [9]:
%%sql
select cName, max(GPA), min(GPA)
from Apply A, Student S
where A.sID = S.sID
group by cName

5 rows affected.

[(u'MIT', 3.7, 3.5),
 (u'Cornell', 3.6, 3.2),
 (u'Carnegie Mellon', 3.9, 3.3),
 (u'Berkeley', 3.7, 3.5),
 (u'Stanford', 3.9, 3.2)]

#### In-Class Exercise: 查询每个学校的申请人中，GPA的最高和最低值，返回校名，GPA的最高和最低值，不能使用group by和聚集函数（课堂检查2）

In [ ]:
%%sql
select 
from Apply A,Student S
where A.sID = S.sID

#### In-Class Exercise: 查询申请人数最多的学校，返回校名和申请人数，不能使用limit（课堂检查3）

In [20]:
%%sql
select cname,count(*)
from apply 
group by cname
except
(
with T(cname,num) as 
(
    select cname,count(*) 
    from apply 
    group by cname
)
select t1.cname,t1.num
from t as t1, t as t2
where t1.num<t2.num
);

1 rows affected.

[(u'Carnegie Mellon', 6L)]

#### In-Class Exercise: Write a SQL query that returns the number of colleges applied by each student including 0 for those who applied nowhere

In [18]:
%sql insert into Student values (345, 'Harry', 3.9, 200);
%sql select * from Student;

1 rows affected.
13 rows affected.

[(123, u'Amy', 3.6, 200),
 (234, u'Bob', 3.5, 200),
 (456, u'Doris', 3.3, 200),
 (567, u'Edward', 3.4, 200),
 (678, u'Fay', 3.9, 200),
 (789, u'Gary', 3.8, 200),
 (987, u'Helen', 3.7, 200),
 (765, u'Jay', 3.2, 200),
 (654, u'Amy', 3.6, 200),
 (543, u'Craig', 3.7, 200),
 (432, u'Kevin', 3.9, 200),
 (321, u'Lori', 3.5, 200),
 (345, u'Harry', 3.9, 200)]

In [22]:
%%sql       SELECT Student.sID, count(distinct cName)
            FROM Student, Apply
            WHERE Student.sID = Apply.sID
            GROUP BY Student.sID
            union
            SELECT sID, 0
            FROM Student
            WHERE sID not in (select sID from Apply);

13 rows affected.

[(678, 1L),
 (567, 1L),
 (654, 1L),
 (765, 2L),
 (432, 1L),
 (456, 1L),
 (123, 4L),
 (543, 1L),
 (789, 1L),
 (234, 1L),
 (321, 1L),
 (345, 0L),
 (987, 2L)]

#### In-Class Exercise: 使用outer join实现查询the number of colleges applied by each student including 0 for those who applied nowhere （课堂检查4）

In [23]:
%%sql 
 select sid,count(distinct cname)
 from student natural left  outer join apply
 group by sid;

13 rows affected.

[(123, 4L),
 (234, 1L),
 (321, 1L),
 (345, 0L),
 (432, 1L),
 (456, 1L),
 (543, 1L),
 (567, 1L),
 (654, 1L),
 (678, 1L),
 (765, 2L),
 (789, 1L),
 (987, 2L)]

### 3.4.8 NULL values
#### In-Class Exercise: Will follow return every student?<br/>
No! There may be student who have NULL as their GPA!

In [8]:
%sql update student set gpa = NULL where sid = 123;
l = %sql SELECT * FROM Student WHERE GPA >= 3.5 or GPA < 3.5;
r = %sql SELECT * FROM Student WHERE GPA >= 3.5 or GPA < 3.5 or GPA is NULL;
side_by_side(l,r)

1 rows affected.
11 rows affected.
12 rows affected.

### 3.5.2 参照完整性
#### 下列语句的执行结果是什么？

In [9]:
%sql   drop table if exists T cascade;
%sql   create table T (A int, B int, C int, primary key (A,B),foreign key (B,C) references T(A,B) on delete cascade);
%sql   insert into T values (1,1,1);
%sql   insert into T values (2,1,1);
for i in range(0, 6):
    %sql insert into T values (3 + :i, 2 + :i, 1 + :i)
%sql   delete from T where A = 1;
%sql   select * from T;

Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.

[]

#### 有如下两个表S,T，下列语句A-F不违反已有完整性约束

In [10]:
def test(inputStr, initStr, outputStr):
    try:
        %sql $initStr
        print '***********************'
        %sql $inputStr
        print outputStr + "通过~"
    except Exception as e:
        print outputStr + "不允许！"
        print e
    print '***********************'

In [11]:
initStr=    """
drop table if exists S cascade;drop table if exists T cascade;
CREATE TABLE S(c INT PRIMARY KEY, d INT); 
CREATE TABLE T(a INT PRIMARY KEY, b INT REFERENCES S(c));
insert into S values(2, 10);insert into S values(3, 11);insert into S values(4, 12);insert into S values(5, 13);
insert into T values(0, 4); insert into T values(1, 5); insert into T values(2, 4); insert into T values(3, 5);
"""

test("Insert into T values (1, 2)",initStr, "(1)选项A")
test("Insert into T values (2, 5)",initStr, "(2)选项B")
test("Insert into S values (4, 4)",initStr, "(3)选项C")
test("Insert into T values (5, 3)",initStr, "(4)选项D")
test("Insert into T values (6, 1)",initStr, "(5)选项E")
test("Insert into T values (6, 4)",initStr, "(6)选项F")

Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
***********************
(psycopg2.OperationalError)  [SQL: 'Insert into T values (1, 2)']
(1)选项A通过~
***********************
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
***********************
(psycopg2.OperationalError)  [SQL: 'Insert into T values (2, 5)']
(2)选项B通过~
***********************
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
***********************
(psycopg2.OperationalError)  [SQL: 'Insert into S values (4, 4)']
(3)选项C通过~
***********************
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
***********************
1 rows affected.
(4)选项D通过~
***********************
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
***********************
(psycopg2.OperationalError)  [SQL: 'Insert into T values (6, 1)']
(5)选项E通过~
***********************
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
***********************
1 rows affected.
(6)选项F通过~
***********************

#### 有如下三个表R、S、T，下列语句A-F不违反已有完整性约束

In [12]:
initStr=   """
        drop table if exists T cascade;drop table if exists S cascade; drop table if exists R cascade;
        CREATE TABLE R(e INT PRIMARY KEY, f INT);CREATE TABLE S(c INT PRIMARY KEY,d INT REFERENCES R(e) ON DELETE CASCADE); 
        CREATE TABLE T(a INT PRIMARY KEY,  b INT REFERENCES S(c) ON DELETE CASCADE);
        insert into R values(1, 0);insert into R values(2, 4);insert into R values(3, 5);insert into R values(4, 3);
        insert into R values(5, 7);insert into S values(1, 5);insert into S values(2, 2);insert into S values(3, 3);
        insert into S values(4, 5);insert into S values(5, 4);insert into T values(0, 2);insert into T values(1, 2);
        insert into T values(2, 3);insert into T values(3, 4);insert into T values(4, 4);"""
test("delete from R where e >= 2",initStr, "(1)选项A")
%sql select * from T;

Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
***********************
4 rows affected.
(1)选项A通过~
***********************
0 rows affected.

[]

In [13]:
test("delete from R where f < 6;",initStr, "(2)选项B")
%sql select * from T;

Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
***********************
4 rows affected.
(2)选项B通过~
***********************
2 rows affected.

[(3, 4), (4, 4)]

In [14]:
test("delete from R where e * f >= 10;",initStr, "(3)选项C")
%sql select * from T;

Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
***********************
3 rows affected.
(3)选项C通过~
***********************
2 rows affected.

[(0, 2), (1, 2)]

In [15]:
test("delete from R where e + f > 6;",initStr, "(4)选项D")
%sql select * from T;

Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
***********************
3 rows affected.
(4)选项D通过~
***********************
2 rows affected.

[(0, 2), (1, 2)]

In [16]:
test("delete from R where f > 3;",initStr, "(5)选项E")
%sql select * from T;

Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
***********************
3 rows affected.
(5)选项E通过~
***********************
0 rows affected.

[]

In [17]:
test("delete from R where e = 5 or f = 5;",initStr, "(6)选项F")
%sql select * from T;

Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
***********************
2 rows affected.
(6)选项F通过~
***********************
2 rows affected.

[(0, 2), (1, 2)]

In [18]:
test("delete from R where e + f < 8;",initStr, "(7)选项G")
%sql select * from T;

Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
***********************
3 rows affected.
(7)选项G通过~
***********************
3 rows affected.

[(2, 3), (3, 4), (4, 4)]

### 3.5.3 用户定义的完整性
#### 思考：一个关系中可以多少个primary key约束，多少个unique约束？

In [19]:
initStr=   """drop table if exists S cascade;
CREATE TABLE S
(Sno      char(7) PRIMARY KEY,
Sname  char(8) ,
Ssex     char(2),
Sage     int,
Sdept    char(20),
UNIQUE (Sname, Sage));"""

In [20]:
test("Alter table S add constraint uni_1 unique(Ssex);",initStr, "添加多个unique")

Done.
Done.
***********************
Done.
添加多个unique通过~
***********************

In [21]:
test("Alter table S add constraint pk_1 primary key(Sdept); ",initStr, "添加多个primary")

Done.
Done.
***********************
(psycopg2.OperationalError)  [SQL: 'Alter table S add constraint pk_1 primary key(Sdept);']
添加多个primary通过~
***********************

#### 思考：插入NULL时，DBMS会报错吗？

In [22]:
initStr=   """
drop table if exists StudentTest cascade;
create table StudentTest(
    sID int, 
    sName text,                     
    GPA real check(GPA <= 4.0 and GPA > 0.0),
    sizeHS int check(sizeHS < 5000));
"""
test("Insert into  StudentTest values(101, 'Tom', NULL, NULL);",initStr, "插入NULL")

Done.
Done.
***********************
1 rows affected.
插入NULL通过~
***********************

### 如下语句能否被各种数据接受？
create table T(A int check(A not in (select A from T)));<br/>
create table T(A int check((select count(distinct A) from T) = (select count(*) from T)));</br>

SQLite, PostgreSQL: several issues<br/>
MySQL: accepts but does no enforce

#### 用check实现Keys

In [23]:
initStr=   """
drop table if exists T cascade;
create table T(A int check(A not in (select A from T)));
"""
test("select * from T" ,initStr, "该语句")

Done.
(psycopg2.OperationalError)  [SQL: 'create table T(A int check(A not in (select A from T)));']
***********************
(psycopg2.OperationalError)  [SQL: 'select * from T']
该语句通过~
***********************

In [24]:
initStr=   """
drop table if exists T cascade;
create table T(A int check((select count(distinct A) from T) = (select count(*) from T)));
"""
test("select * from T" ,initStr, "该语句")

Done.
(psycopg2.OperationalError)  [SQL: 'create table T(A int check((select count(distinct A) from T) = (select count(*) from T)));']
***********************
(psycopg2.OperationalError)  [SQL: 'select * from T']
该语句通过~
***********************

#### 用check实现NOT NULL限制

In [25]:
initStr = """
drop table if exists StudentTest cascade;
create table StudentTest(sID int, sName text, GPA real check(GPA is not null), sizeHS int);
"""
test("select * from StudentTest" ,initStr, "该语句")

Done.
Done.
***********************
0 rows affected.
该语句通过~
***********************